{"config": {"name": "model_70", "output_layers": [["dense_140", 0, 0]], "input_layers": [["ancestors", 0, 0], ["siblings2", 0, 0], ["siblings3", 0, 0], ["siblings3_", 0, 0], ["siblings4", 0, 0], ["siblings4_", 0, 0]], "layers": [{"name": "ancestors", "config": {"name": "ancestors", "batch_input_shape": [null, 250], "input_dtype": "int32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "siblings2", "config": {"name": "siblings2", "batch_input_shape": [null, 100], "input_dtype": "int32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "siblings3", "config": {"name": "siblings3", "batch_input_shape": [null, 150], "input_dtype": "int32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "siblings3_", "config": {"name": "siblings3_", "batch_input_shape": [null, 150], "input_dtype": "int32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "siblings4", "config": {"name": "siblings4", "batch_input_shape": [null, 200], "input_dtype": "int32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "siblings4_", "config": {"name": "siblings4_", "batch_input_shape": [null, 200], "input_dtype": "int32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_75", "config": {"name": "embedding_75", "trainable": true, "W_constraint": null, "input_dim": 18078, "dropout": 0.0, "output_dim": 300, "mask_zero": false, "input_dtype": "int32", "init": "uniform", "W_regularizer": null, "batch_input_shape": [null, null], "activity_regularizer": null, "input_length": null}, "class_name": "Embedding", "inbound_nodes": [[["ancestors", 0, 0]], [["siblings2", 0, 0]], [["siblings3", 0, 0]], [["siblings3_", 0, 0]], [["siblings4", 0, 0]], [["siblings4_", 0, 0]]]}, {"name": "convolution1d_557", "config": {"name": "convolution1d_557", "trainable": true, "W_constraint": null, "filter_length": 3, "input_dim": null, "border_mode": "valid", "subsample_length": 5, "b_constraint": null, "input_length": null, "init": "uniform", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "nb_filter": 100}, "class_name": "Convolution1D", "inbound_nodes": [[["embedding_75", 0, 0]]]}, {"name": "convolution1d_558", "config": {"name": "convolution1d_558", "trainable": true, "W_constraint": null, "filter_length": 4, "input_dim": null, "border_mode": "valid", "subsample_length": 5, "b_constraint": null, "input_length": null, "init": "uniform", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "nb_filter": 100}, "class_name": "Convolution1D", "inbound_nodes": [[["embedding_75", 0, 0]]]}, {"name": "convolution1d_559", "config": {"name": "convolution1d_559", "trainable": true, "W_constraint": null, "filter_length": 5, "input_dim": null, "border_mode": "valid", "subsample_length": 5, "b_constraint": null, "input_length": null, "init": "uniform", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "nb_filter": 100}, "class_name": "Convolution1D", "inbound_nodes": [[["embedding_75", 0, 0]]]}, {"name": "convolution1d_560", "config": {"name": "convolution1d_560", "trainable": true, "W_constraint": null, "filter_length": 2, "input_dim": null, "border_mode": "valid", "subsample_length": 2, "b_constraint": null, "input_length": null, "init": "uniform", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "nb_filter": 100}, "class_name": "Convolution1D", "inbound_nodes": [[["embedding_75", 1, 0]]]}, {"name": "convolution1d_561", "config": {"name": "convolution1d_561", "trainable": true, "W_constraint": null, "filter_length": 3, "input_dim": null, "border_mode": "valid", "subsample_length": 3, "b_constraint": null, "input_length": null, "init": "uniform", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "nb_filter": 100}, "class_name": "Convolution1D", "inbound_nodes": [[["embedding_75", 2, 0]]]}, {"name": "convolution1d_562", "config": {"name": "convolution1d_562", "trainable": true, "W_constraint": null, "filter_length": 3, "input_dim": null, "border_mode": "valid", "subsample_length": 3, "b_constraint": null, "input_length": null, "init": "uniform", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "nb_filter": 100}, "class_name": "Convolution1D", "inbound_nodes": [[["embedding_75", 3, 0]]]}, {"name": "convolution1d_563", "config": {"name": "convolution1d_563", "trainable": true, "W_constraint": null, "filter_length": 4, "input_dim": null, "border_mode": "valid", "subsample_length": 4, "b_constraint": null, "input_length": null, "init": "uniform", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "nb_filter": 100}, "class_name": "Convolution1D", "inbound_nodes": [[["embedding_75", 4, 0]]]}, {"name": "convolution1d_564", "config": {"name": "convolution1d_564", "trainable": true, "W_constraint": null, "filter_length": 4, "input_dim": null, "border_mode": "valid", "subsample_length": 4, "b_constraint": null, "input_length": null, "init": "uniform", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "nb_filter": 100}, "class_name": "Convolution1D", "inbound_nodes": [[["embedding_75", 5, 0]]]}, {"name": "maxpooling1d_70", "config": {"name": "maxpooling1d_70", "trainable": true, "stride": 50, "border_mode": "valid", "pool_length": 50}, "class_name": "MaxPooling1D", "inbound_nodes": [[["convolution1d_557", 0, 0]], [["convolution1d_558", 0, 0]], [["convolution1d_559", 0, 0]], [["convolution1d_560", 0, 0]], [["convolution1d_561", 0, 0]], [["convolution1d_562", 0, 0]], [["convolution1d_563", 0, 0]], [["convolution1d_564", 0, 0]]]}, {"name": "flatten_70", "config": {"name": "flatten_70", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["maxpooling1d_70", 0, 0]], [["maxpooling1d_70", 1, 0]], [["maxpooling1d_70", 2, 0]], [["maxpooling1d_70", 3, 0]], [["maxpooling1d_70", 4, 0]], [["maxpooling1d_70", 5, 0]], [["maxpooling1d_70", 6, 0]], [["maxpooling1d_70", 7, 0]]]}, {"name": "merge_70", "config": {"name": "merge_70", "dot_axes": [-1, -1], "output_shape": null, "concat_axis": -1, "mode": "concat", "mode_type": "raw", "output_shape_type": "raw"}, "class_name": "Merge", "inbound_nodes": [[["flatten_70", 0, 0], ["flatten_70", 1, 0], ["flatten_70", 2, 0], ["flatten_70", 3, 0], ["flatten_70", 4, 0], ["flatten_70", 5, 0], ["flatten_70", 6, 0], ["flatten_70", 7, 0]]]}, {"name": "dropout_139", "config": {"name": "dropout_139", "trainable": true, "p": 0.25}, "class_name": "Dropout", "inbound_nodes": [[["merge_70", 0, 0]]]}, {"name": "dense_139", "config": {"name": "dense_139", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 200, "activity_regularizer": null, "activation": "relu", "b_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_139", 0, 0]]]}, {"name": "dropout_140", "config": {"name": "dropout_140", "trainable": true, "p": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["dense_139", 0, 0]]]}, {"name": "dense_140", "config": {"name": "dense_140", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 3, "activity_regularizer": null, "activation": "softmax", "b_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_140", 0, 0]]]}]}, "class_name": "Model"}